app/controllers/customers_controller.rb

  def show
    customer_detail = CustomerDetail.find(params[:id])
---
SELECT  "customer_details".* FROM "customer_details" WHERE "customer_details"."customer_id" = $1 LIMIT $2  [["customer_id", 73], ["LIMIT", 1]]

  def index
    @page = (params[:page] || 0).to_i
    if params[:keywords].present?
      @keywords = params[:keywords]
      customer_search_term = CustomerSearchTerm.new(@keywords)
      @customers = Customer.where(
        customer_search_term.where_clause,
        customer_search_term.where_args).
        order(customer_search_term.order).
        offset(PAGE_SIZE * @page).limit(PAGE_SIZE)
---
SELECT  "customers".* FROM "customers" WHERE (lower(first_name) like 'cervanteshuerta%' OR lower(last_name) like 'cervanteshuerta%' OR lower(email) like 'cervanteshuerta@') ORDER BY lower(email) = 'cervanteshuerta@' desc, last_name asc LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]

  def update
    customer_detail = CustomerDetail.find(params[:id])
    customer_detail.update(params)
---
SELECT  "customer_details".* FROM "customer_details" WHERE "customer_details"."customer_id" = $1 LIMIT $2  [["customer_id", 344], ["LIMIT", 1]]
UPDATE "customers" SET "email" = $1, "updated_at" = $2 WHERE "customers"."id" = $3  [["email", "cervanteshuerta@gleasonhuel.org"], ["updated_at", "2018-04-14 14:33:35.903249"], ["id", 344]]